#+title:    build-locally Org file
#+author:   Brent Goodrick
#+STARTUP:  hideblocks

*** Determine the rpaths of all shared libraries

#+BEGIN_SRC sh :results verbatim
  LD_LIBRARY_PATH=~/install/RHEL.6.4.x86_64/lib \
    find ~/install/RHEL.6.4.x86_64/lib/ -mtime -2 -name '*.so' | \
    xargs -i sh -c "ldd {} | sed 's%^%{} %g'" 2>&1 | grep '=>.*RHEL.6.4.x86_64' | awk1 | while read lib
  do
    curRpath=$(objdump -x $lib | grep RPATH | awk '{printf("%s\n",$2);}')
    if [ "$curRpath" != "$INSTALL_DIR/lib" ]
    then
      echo lib $lib $curRpath
      break
    fi
  done
#+END_SRC

#+RESULTS:
: lib /home/brentg/install/RHEL.6.4.x86_64/lib/libgobject-2.0.so /home/brentg/install/RHEL.6.4.x86_64/lib:/home/brentg/install/RHEL.6.4.x86_64/lib/../lib64

So the above results tells us that we cannot simply set LD_RUN_PATH to be a single path. It will vary from package to package.

Besides many if not all of the shared libraries have the RPATH set
already, presumably by default due to use of the use of
autoconf/automake/libtool/etc.

